01 :prefix:task-note-rec.
    05 :prefix:task-note-id pic 999999.
    05 :prefix:task-note-task-id pic 99999.
    05 :prefix:task-note-text pic X(200).
    05 :prefix:task-note-created-at pic 9(8).
