01 ws-da-defs.
    05 ws-file-action pic X(10).
    05 ws-file-info.
        10 ws-file-name pic X(100).
        10 ws-file-mode pic X(2).
            88 DA_MODE_READ_ONLY value 'r'.
            88 DA_MODE_WRITE     value 'w'.
            88 DA_MODE_READWRITE value 'rw'.
    05 ws-result pic X(10).
        88     DA_SUCCESS                    value '00'.
        88     DA_SUCCESS_DUPLICATE          value '02'.
        88     DA_SUCCESS_INCOMPLETE         value '04'.
        88     DA_SUCCESS_OPTIONAL           value '05'.
        88     DA_SUCCESS_NO_UNIT            value '07'.
        88     DA_END_OF_FILE                value '10'.
        88     DA_OUT_OF_KEY_RANGE           value '14'.
        88     DA_KEY_INVALID                value '21'.
        88     DA_KEY_EXISTS                 value '22'.
        88     DA_KEY_NOT_EXISTS             value '23'.
        88     DA_PERMANENT_ERROR            value '30'.
        88     DA_INCONSISTENT_FILENAME      value '31'.
        88     DA_BOUNDARY_VIOLATION         value '34'.
        88     DA_NOT_EXISTS                 value '35'.
        88     DA_PERMISSION_DENIED          value '37'.
        88     DA_CLOSED_WITH_LOCK           value '38'.
        88     DA_CONFLICT_ATTRIBUTE         value '39'.
        88     DA_ALREADY_OPEN               value '41'.
        88     DA_NOT_OPEN                   value '42'.
        88     DA_READ_NOT_DONE              value '43'.
        88     DA_RECORD_OVERFLOW            value '44'.
        88     DA_READ_ERROR                 value '46'.
        88     DA_INPUT_DENIED               value '47'.
        88     DA_OUTPUT_DENIED              value '48'.
        88     DA_I_O_DENIED                 value '49'.
        88     DA_RECORD_LOCKED              value '51'.
        88     DA_END_OF_PAGE                value '52'.
        88     DA_I_O_LINAGE                 value '57'.
        88     DA_FILE_SHARING               value '61'.
        88     DA_NOT_AVAILABLE              value '91'.
